# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 9  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [                                 #                 index            channel
   [-1, 1, Rx,[]], #                                    0                 3
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2         
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4       
   [-1, 3, C3, [128]], #                           
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8           
   [-1, 6, C3, [256]],    #               
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16         
   [-1, 9, C3, [512]],    # 6                 
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32          
   [-1, 3, C3, [1024]],  #                        
   [-1, 1, SPPF, [1024, 5]],  # 9                   
  ]
  # [from, number, module, args]
exbackbone:
  [
    [  0, 1, filter,[3]],#                
    [ -1, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0-P1/2        
    [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 1-P2/4 
    [ -1, 3, C3, [ 128 ] ], #                 
    [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 3-P3/8       
    [ -1, 6, C3, [ 256 ] ],#               
    [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 5-P4/16      
    [ -1, 9, C3, [ 512 ] ],    # 6                  
    [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 7-P5/32         
    [ -1, 3, C3, [ 1024 ] ],#                        
    [ -1, 1, SPPF, [ 1024, 5 ] ],  # 
  ]

ex:
  [
    [[1,12],1,Add,[]],  # 
    [[-1,2,13],1,downAdd,[32]], #          
    [[-1,4,15],1,downAdd,[64]], #       
    [[-1,6,17],1,downAdd,[128]],
    [[-1,8,19],1,downAdd,[256]], 
    [[-1,10,21],1,addWeight,[1,1]],#                     
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]], #                        28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#         29
   [[-1,7], 1, ms_Concat, [256,1]],  # cat backbone P4  30
   [-1, 3, C3, [512, False]],  # 13                     31

   [-1, 1, Conv, [256, 1, 1]],   #                      32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#         33
   [[-1, 5], 1, ms_Concat, [128,1]],  # cat backbone P3 34
   #[[0,-1], 1, Branch, [3, 1]],#                        3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)        35

   [-1, 1, Conv, [256, 3, 2]],#                         36
   [[-1, 32], 1, ms_Concat, [128,1]],  # cat head P4    37
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)      38

   [-1, 1, Conv, [512, 3, 2]],#                         39
   [[-1, 28], 1, ms_Concat, [256,1]],  # cat head P5    40
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)      41

   [[35, 38, 41], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  42
  ]

